'''
接口排序
需要排序的列表:

port_list = ['eth 1/101/1/42','eth 1/101/1/26','eth 1/101/1/23','eth 1/101/1/7','eth 1/101/2/46','eth 1/101/1/34','eth 1/101/1/18','eth 1/101/1/13','eth 1/101/1/32','eth 1/101/1/25','eth 1/101/1/45','eth 1/101/2/8']
需要排序的结果（按接口编号数值从小到大）:

['eth 1/101/1/7', 'eth 1/101/1/13', 'eth 1/101/1/18', 'eth 1/101/1/23', 'eth 1/101/1/25', 'eth 1/101/1/26', 'eth 1/101/1/32', 'eth 1/101/1/34', 'eth 1/101/1/42', 'eth 1/101/1/45', 'eth 1/101/2/8', 'eth 1/101/2/46']
作业提示: Google 搜索 "python sort lambda"

注意: 一句话就能解决
'''
port_list = ['eth 1/101/1/42','eth 1/101/1/26','eth 1/101/1/23','eth 1/101/1/7','eth 1/101/2/46','eth 1/101/1/34','eth 1/101/1/18','eth 1/101/1/13','eth 1/101/1/32','eth 1/101/1/25','eth 1/101/1/45','eth 1/101/2/8']
#sorted(..., key=...)  会按 key 返回的值排序
#s.split(' ')[1]       先按空格切分，拿到 '1/101/1/42' 这一部分。
#.split('/')           再次拆分，得到列表 ['1', '101', '1', '42']
#int(x) for x in       这是列表推导式，将字符串列表转换成整数列表：[1, 101, 1, 42]
sorted_port_list = sorted(port_list, key=lambda s: [int(x) for x in s.split(' ')[1].split('/')])
print(sorted_port_list)