'''
列表引用与拷贝：对比 l2 = l1 和 l2 = l1.copy()
已知接口速率列表:

l1 = [100, 1000, 10, 400, 25, 40, 0]
将 l1 赋值给 l2（可以尝试引用 l2 = l1 或拷贝 l2 = l1.copy()），然后对 l2 进行从小到大排序，最后用循环并排打印 l1 和 l2:

l1      l2
100     0
1000    10
10      25
400     40
25      100
40      400
0       1000
思考：使用引用和拷贝时，l1 的值是否会发生变化？为什么？
'''
l1 = [100, 1000, 10, 400, 25, 40, 0]
#  l2 , l1 是独立的使用copy
l2 = l1.copy() 
# 对 l2 进行排序
l2.sort()

# 打印表头
print("{:<10}{:<10}".format("l1", "l2"))

# 使用 zip 同时循环两个列表并排打印
for i, j in zip(l1, l2):
    print("{:<10}{:<10}".format(i, j))

print('-'*20)
# =是非独立的
l3=l1
l3.sort()
print("{:<10}{:<10}".format("l1", "l3"))
for i, j in zip(l1, l2):
    print("{:<10}{:<10}".format(i, j))